БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыHTML/ПараметрыHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПараметрыHTML</name>
  <type>
    <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтрокиЭМКНеограниченнойДлины</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
    <types>DocumentRef.Прием</types>
    <types>CatalogRef.ИнструментальныеИсследования</types>
    <types>CatalogRef.ДействующиеВеществаЛекарственныхПрепаратов</types>
    <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    <types>Boolean</types>
    <types>CatalogRef.СоглашенияСтрахования</types>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Филиалы</types>
    <types>DocumentRef.ДоговорСКлиентом</types>
    <types>CatalogRef.СтраховыеПолисы</types>
    <types>String</types>
    <types>CatalogRef.Диагнозы</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>CatalogRef.КатегорииВыработки</types>
    <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
    <types>CatalogRef.ЛабораторныеТесты</types>
    <types>Number</types>
    <types>CatalogRef.МедицинскоеОборудование</types>
    <types>CatalogRef.ВидыМедицинскихДокументов</types>
    <types>CatalogRef.КлассификаторыМинЗдрава</types>
    <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    <numberQualifiers>
      <precision>18</precision>
      <scale>4</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПрофпатологДополнениеКЗаключению</name>
      <description>Профпатолог: Дополнение к заключению</description>
      <code>000000005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологЗаключение</name>
      <description>Профпатолог: Заключение</description>
      <code>000000001</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологИнфекционныйАнамнез</name>
      <description>Профпатолог: Инфекционный анамнез</description>
      <code>000000004</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологРекомендации</name>
      <description>Профпатолог: Рекомендации</description>
      <code>000000002</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологСведенияОПрививках</name>
      <description>Профпатолог: Сведения о прививках</description>
      <code>000000003</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВычисляемыеЗначенияПараметров</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
      <types>CatalogRef.ИнструментальныеИсследования</types>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
      <types>Boolean</types>
      <types>CatalogRef.СоглашенияСтрахования</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.СтраховыеПолисы</types>
      <types>String</types>
      <types>CatalogRef.Диагнозы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>Date</types>
      <types>CatalogRef.КатегорииВыработки</types>
      <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
      <types>CatalogRef.ЛабораторныеТесты</types>
      <types>Number</types>
      <types>CatalogRef.МедицинскоеОборудование</types>
      <types>CatalogRef.ВидыМедицинскихДокументов</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВычисляемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗаполняетсяПредыдущимиЗначениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноДляЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПрофпатологом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРедактируетсяПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборПоСсылкеИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлассификатора</name>
    <type>
      <types>EnumRef.ВидыКлассификаторовМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнятьГотовымиФразамиВыборИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.КодировкаПолейЭМД</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПакетыСоставныхФраз</name>
    <attributes>
      <name>Пакет</name>
      <type>
        <types>CatalogRef.ПакетыСоставныхФраз</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияВыбора</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоГруппа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>String</types>
        <types>Number</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/Enums/КодировкаПолейЭМД/КодировкаПолейЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодировкаПолейЭМД</name>
  <enumValues>
    <name>СведенияОЛисткеНетрудоспособности</name>
  </enumValues>
  <enumValues>
    <name>СЭМДЗначениеНеопределённогоВитальногоПараметра</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыHTML/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.КлассификаторыМинЗдрава")) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидКлассификатора");
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ТипЗначения.СодержитТип(Тип("Строка"))
		И ПакетыСоставныхФраз.Количество() <> 0
	Тогда
		ПакетыСоставныхФраз.Очистить();
	КонецЕсли;
	
	Если Не ЭтоГруппа
		И Не ТипЗначения.СодержитТип(Тип("СправочникСсылка.КлассификаторыМинЗдрава"))
	Тогда
		ВидКлассификатора = Неопределено;
	КонецЕсли;
	
	Если Не ЭтоГруппа
		И Не ЗначениеЗаполнено(Назначение)
		И Назначение <> Неопределено
	Тогда
		Назначение = Неопределено;
	КонецЕсли;
	
	Если Назначение = Перечисления.КодировкаПолейЭМД.СЭМДЗначениеНеопределённогоВитальногоПараметра Тогда
		ТипЗначения = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
